/** @file

;******************************************************************************
;* Copyright (c) 2014 - 2015, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#
//
// Form 0x222: USB configuration
//
#string STR_USB_OPTIONS_FORM_TITLE                          #language en-US "USB Configuration" 
#string STR_USB_OPTIONS_FORM_HELP                           #language en-US "USB Configuration Settings"
#string STR_USB_XHCI_SUPPORT_PROMPT                         #language en-US "XHCI Controller"
#string STR_USB_XHCI_SUPPORT_HELP                           #language en-US "Enable/Disable the USB XHCI PreBoot Support.\n"
#string STR_USB_XHCI_LPM_SUPPORT_PROMPT                     #language en-US "USB2 Link Power Management"
#string STR_USB_XHCI_LPM_SUPPORT_HELP                       #language en-US "Enable/Disable USB2 Link Power Management "
#string STR_PCH_USB30_MODE_PROMPT                           #language en-US "xHCI Mode"
#string STR_PCH_USB30_MODE_HELP                             #language en-US "Mode of operation of xHCI controller.\n\n Enable:Allows USB 3.0 to be supported in the OS and BIOS.\n"
#string STR_PCH_USB30_STREAMS                               #language en-US "XHCI Streams"
#string STR_PCH_USB30_STREAMS_HELP                          #language en-US "Enable/Disable XHCI Streams"
#string STR_PCH_USB_OTG_PROMPT                              #language en-US "USB OTG Support"
#string STR_PCH_USB_OTG_HELP                                #language en-US "Enable/Disable USB OTG Support. \n\nIn AUTO mode, OTG will only be enabled when Andriod OS selected."
#string STR_PCH_USB21_PROMPT                                #language en-US "EHCI Contorller"
#string STR_PCH_USB2_HELP                                   #language en-US "Control the USB EHCI (USB 2.0) functions.\n\nOne EHCI controller must always be enabled"
#string STR_PCH_USB_PER_PORT_PROMPT                         #language en-US "USB Per-Port Control"
#string STR_PCH_USB_PER_PORT_HELP                           #language en-US "Control each of the USB ports (0~9) disabling"
#string STR_PCH_USB_PORT0_PROMPT                            #language en-US "USB Port #0"
#string STR_PCH_USB_PORT1_PROMPT                            #language en-US "USB Port #1"
#string STR_PCH_USB_PORT2_PROMPT                            #language en-US "USB Port #2"
#string STR_PCH_USB_PORT3_PROMPT                            #language en-US "USB Port #3"
#string STR_PCH_USB_PORT4_PROMPT                            #language en-US "USB Port #4"
#string STR_PCH_USB_PORT5_PROMPT                            #language en-US "USB Port #5"
#string STR_PCH_USB_PORT6_PROMPT                            #language en-US "USB Port #6"
#string STR_PCH_USB_PORT7_PROMPT                            #language en-US "USB Port #7"
#string STR_PCH_USB_PORT_DIS_HELP                           #language en-US "Disable USB port"
#string STR_PCH_USBRMH_PROMPT                               #language en-US "USB RMH Mode"
#string STR_PCH_USBRMH_HELP                                 #language en-US "Enable/Disable PCH USB Rate Matching Hubs mode"
#string STR_SMARTAUTO_STRING                                #language en-US "Smart Auto"
#string STR_PCH_USB_EHCIDEBUG_PROMPT                        #language en-US "USB EHCI debug"
#string STR_PCH_USB_EHCIDEBUG_HELP                          #language en-US "Enable/Disable PCH EHCI debug capability"
#string STR_USB_EHCI1_ENABLE_STRING     #language en-US        "EHCI 1"
                                        #language fr-FR        "EHCI 1"
                                        #language it-IT        "EHCI 1"
                                        #language es-ES        "EHCI 1"
#string STR_USB_EHCI1_ENABLE_HELP       #language en-US        "Enable/Disable EHCI 1"
                                        #language fr-FR        "Enable/Disable EHCI 1"
                                        #language zh-TW        "\wide啟用或取消\narrowEHCI 1"
                                        #language it-IT        "Abilitare/Disabilitare EHCI 1"
                                        #language es-ES        "Permita/Inhabilite EHCI 1"
#string STR_USB_EHCI2_ENABLE_STRING     #language en-US        "EHCI 2"
                                        #language fr-FR        "EHCI 2"
                                        #language it-IT        "EHCI 2"
                                        #language es-ES        "EHCI 2"
#string STR_USB_EHCI2_ENABLE_HELP       #language en-US        "Enable/Disable EHCI 2"
                                        #language fr-FR        "Enable/Disable EHCI 2"
                                        #language zh-TW        "\wide啟用或取消\narrowEHCI 2"
                                        #language it-IT        "Abilitare/Disabilitare EHCI 2"
                                        #language es-ES        "Permita/Inhabilite EHCI 2"
#string STR_USB_UHCI1_ENABLE_STRING     #language en-US        "UHCI 1"
                                        #language fr-FR        "UHCI 1"
                                        #language it-IT        "UHCI 1"
                                        #language es-ES        "UHCI 1"
#string STR_USB_UHCI1_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 1"
                                        #language fr-FR        "Enable/Disable UHCI 1"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 1"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 1"
                                        #language es-ES        "Permita/Inhabilite UHCI 1"
#string STR_USB_UHCI2_ENABLE_STRING     #language en-US        "UHCI 2"
                                        #language fr-FR        "UHCI 2"
                                        #language it-IT        "UHCI 2"
                                        #language es-ES        "UHCI 2"
#string STR_USB_UHCI2_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 2"
                                        #language fr-FR        "Enable/Disable UHCI 2"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 2"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 2"
                                        #language es-ES        "Permita/Inhabilite UHCI 2"
#string STR_USB_UHCI3_ENABLE_STRING     #language en-US        "UHCI 3"
                                        #language fr-FR        "UHCI 3"
                                        #language it-IT        "UHCI 3"
                                        #language es-ES        "UHCI 3"
#string STR_USB_UHCI3_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 3"
                                        #language fr-FR        "Enable/Disable UHCI 3"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 3"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 3"
                                        #language es-ES        "Permita/Inhabilite UHCI 3"
#string STR_USB_UHCI4_ENABLE_STRING     #language en-US        "UHCI 4"
                                        #language fr-FR        "UHCI 4"
                                        #language it-IT        "UHCI 4"
                                        #language es-ES        "UHCI 4"
#string STR_USB_UHCI4_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 4"
                                        #language fr-FR        "Enable/Disable UHCI 4"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 4"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 4"
                                        #language es-ES        "Permita/Inhabilite UHCI 4"
#string STR_USB_UHCI5_ENABLE_STRING     #language en-US        "UHCI 5"
                                        #language fr-FR        "UHCI 5"
                                        #language it-IT        "UHCI 5"
                                        #language es-ES        "UHCI 5"
#string STR_USB_UHCI5_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 5"
                                        #language fr-FR        "Enable/Disable UHCI 5"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 5"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 5"
                                        #language es-ES        "Permita/Inhabilite UHCI 5"
#string STR_USB_UHCI6_ENABLE_STRING     #language en-US        "UHCI 6"
                                        #language fr-FR        "UHCI 6"
                                        #language it-IT        "UHCI 6"
                                        #language es-ES        "UHCI 6"
#string STR_USB_UHCI6_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 6"
                                        #language fr-FR        "Enable/Disable UHCI 6"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 6"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 6"
                                        #language es-ES        "Permita/Inhabilite UHCI 6"
#string STR_USB_UHCI7_ENABLE_STRING     #language en-US        "UHCI 7"
                                        #language fr-FR        "UHCI 7"
                                        #language it-IT        "UHCI 7"
                                        #language es-ES        "UHCI 7"
#string STR_USB_UHCI7_ENABLE_HELP       #language en-US        "Enable/Disable UHCI 7"
                                        #language fr-FR        "Enable/Disable UHCI 7"
                                        #language zh-TW        "\wide啟用或取消\narrowUHCI 7"
                                        #language it-IT        "Abilitare/Disabilitare UHCI 7"
                                        #language es-ES        "Permita/Inhabilite UHCI 7"
#string STR_USB_PREPORT_CONTROL_STRING  #language en-US        "Pre-Port Control"
                                        #language fr-FR        "Pre-Port Control"
                                        #language zh-TW        "\wide每個埠的控制\narrow"
                                        #language it-IT        "Pre-Port Control"
                                        #language es-ES        "Pre-Port Control"

#string STR_USB_PREPORT_CONTROL_HELP    #language en-US        "Enable/Disable the Per-Port Disable Control Override"
                                        #language fr-FR        "Enable/Disable the Per-Port Disable Control Override"
                                        #language zh-TW        "\wide啟用或取消\narrowUSB\wide埠控制\narrow"
                                        #language it-IT        "Enable/Disable the Per-Port Disable Control Override"
                                        #language es-ES        "Enable/Disable the Per-Port Disable Control Override"
#string STR_USB_PORT0_ENABLE_STRING     #language en-US        "Usb Port0"
                                        #language fr-FR        "Usb Port0"
                                        #language zh-TW        "Usb\wide埠\narrow0"
                                        #language it-IT        "Usb Porta 0"
                                        #language es-ES        "Usb Porta 0"
#string STR_USB_PORT0_ENABLE_HELP       #language en-US        "Enable/Disable Port 0"
                                        #language fr-FR        "Enable/Disable Port 0"
                                        #language zh-TW        "\wide啟用或取消埠\narrow0"
                                        #language it-IT        "Abilitare/Disabilitare Porta 0"
                                        #language es-ES        "Permita/Inhabilite Porta 0"
#string STR_USB_PORT1_ENABLE_STRING     #language en-US        "Usb Port1"
                                        #language fr-FR        "Usb Port1"
                                        #language zh-TW        "Usb\wide埠\narrow1"
                                        #language it-IT        "Usb Porta 1"
                                        #language es-ES        "Usb Porta 1"
#string STR_USB_PORT1_ENABLE_HELP       #language en-US        "Enable/Disable Port 1"
                                        #language fr-FR        "Enable/Disable Port 1"
                                        #language zh-TW        "\wide啟用或取消埠\narrow1"
                                        #language it-IT        "Abilitare/Disabilitare Porta 1"
                                        #language es-ES        "Permita/Inhabilite Porta 1"
#string STR_USB_PORT2_ENABLE_STRING     #language en-US        "Usb Port2"
                                        #language fr-FR        "Usb Port2"
                                        #language zh-TW        "Usb\wide埠\narrow2"
                                        #language it-IT        "Usb Porta 2"
                                        #language es-ES        "Usb Porta 2"
#string STR_USB_PORT2_ENABLE_HELP       #language en-US        "Enable/Disable Port 2"
                                        #language fr-FR        "Enable/Disable Port 2"
                                        #language zh-TW        "\wide啟用或取消埠\narrow2"
                                        #language it-IT        "Abilitare/Disabilitare Porta 2"
                                        #language es-ES        "Permita/Inhabilite Porta 2"
#string STR_USB_PORT3_ENABLE_STRING     #language en-US        "Usb Port3"
                                        #language fr-FR        "Usb Port3"
                                        #language zh-TW        "Usb\wide埠\narrow3"
                                        #language it-IT        "Usb Porta 3"
                                        #language es-ES        "Usb Porta 3"
#string STR_USB_PORT3_ENABLE_HELP       #language en-US        "Enable/Disable Port 3"
                                        #language fr-FR        "Enable/Disable Port 3"
                                        #language zh-TW        "\wide啟用或取消埠\narrow3"
                                        #language it-IT        "Abilitare/Disabilitare Porta 3"
                                        #language es-ES        "Permita/Inhabilite Porta 3"
#string STR_USB_PORT4_ENABLE_STRING     #language en-US        "Usb Port4"
                                        #language fr-FR        "Usb Port4"
                                        #language zh-TW        "Usb\wide埠\narrow4"
                                        #language it-IT        "Usb Porta 4"
                                        #language es-ES        "Usb Porta 4"
#string STR_USB_PORT4_ENABLE_HELP       #language en-US        "Enable/Disable Port 4"
                                        #language fr-FR        "Enable/Disable Port 4"
                                        #language zh-TW        "\wide啟用或取消埠\narrow4"
                                        #language it-IT        "Abilitare/Disabilitare Porta 4"
                                        #language es-ES        "Permita/Inhabilite Porta 4"
#string STR_USB_PORT5_ENABLE_STRING     #language en-US        "Usb Port5"
                                        #language fr-FR        "Usb Port5"
                                        #language zh-TW        "Usb\wide埠\narrow5"
                                        #language it-IT        "Usb Porta 5"
                                        #language es-ES        "Usb Porta 5"
#string STR_USB_PORT5_ENABLE_HELP       #language en-US        "Enable/Disable Port 5"
                                        #language fr-FR        "Enable/Disable Port 5"
                                        #language zh-TW        "\wide啟用或取消埠\narrow5"
                                        #language it-IT        "Abilitare/Disabilitare Porta 5"
                                        #language es-ES        "Permita/Inhabilite Porta 5"
#string STR_USB_PORT6_ENABLE_STRING     #language en-US        "Usb Port6"
                                        #language fr-FR        "Usb Port6"
                                        #language zh-TW        "Usb\wide埠\narrow6"
                                        #language it-IT        "Usb Porta 6"
                                        #language es-ES        "Usb Porta 6"
#string STR_USB_PORT6_ENABLE_HELP       #language en-US        "Enable/Disable Port 6"
                                        #language fr-FR        "Enable/Disable Port 6"
                                        #language zh-TW        "\wide啟用或取消埠\narrow6"
                                        #language it-IT        "Abilitare/Disabilitare Porta 6"
                                        #language es-ES        "Permita/Inhabilite Porta 6"
#string STR_USB_PORT7_ENABLE_STRING     #language en-US        "Usb Port7"
                                        #language fr-FR        "Usb Port7"
                                        #language zh-TW        "Usb\wide埠\narrow7"
                                        #language it-IT        "Usb Porta 7"
                                        #language es-ES        "Usb Porta 7"
#string STR_USB_PORT7_ENABLE_HELP       #language en-US        "Enable/Disable Port 7"
                                        #language fr-FR        "Enable/Disable Port 7"
                                        #language zh-TW        "\wide啟用或取消埠\narrow7"
                                        #language it-IT        "Abilitare/Disabilitare Porta 7"
                                        #language es-ES        "Permita/Inhabilite Porta 7"
#string STR_USB_PORT8_ENABLE_STRING     #language en-US        "Usb Port8"
                                        #language fr-FR        "Usb Port8"
                                        #language zh-TW        "Usb\wide埠\narrow8"
                                        #language it-IT        "Usb Porta 8"
                                        #language es-ES        "Usb Porta 8"
#string STR_USB_PORT8_ENABLE_HELP       #language en-US        "Enable/Disable Port 8"
                                        #language fr-FR        "Enable/Disable Port 8"
                                        #language zh-TW        "\wide啟用或取消埠\narrow8"
                                        #language it-IT        "Abilitare/Disabilitare Porta 8"
                                        #language es-ES        "Permita/Inhabilite Porta 8"
#string STR_USB_PORT9_ENABLE_STRING     #language en-US        "Usb Port9"
                                        #language fr-FR        "Usb Port9"
                                        #language zh-TW        "Usb\wide埠\narrow9"
                                        #language it-IT        "Usb Porta 9"
                                        #language es-ES        "Usb Porta 9"
#string STR_USB_PORT9_ENABLE_HELP       #language en-US        "Enable/Disable Port 9"
                                        #language fr-FR        "Enable/Disable Port 9"
                                        #language zh-TW        "\wide啟用或取消埠\narrow9"
                                        #language it-IT        "Abilitare/Disabilitare Porta 9"
                                        #language es-ES        "Permita/Inhabilite Porta 9"
#string STR_USB_PORT10_ENABLE_STRING    #language en-US        "Usb Port10"
                                        #language fr-FR        "Usb Port10"
                                        #language zh-TW        "Usb\wide埠\narrow10"
                                        #language it-IT        "Usb Porta 10"
                                        #language es-ES        "Usb Porta 10"
#string STR_USB_PORT10_ENABLE_HELP      #language en-US        "Enable/Disable Port 10"
                                        #language en-US        "Enable/Disable Port 10"
                                        #language zh-TW        "\wide啟用或取消埠\narrow10"
                                        #language it-IT        "Abilitare/Disabilitare Porta 10"
                                        #language es-ES        "Permita/Inhabilite Porta 10"

#string STR_USB_PORT11_ENABLE_STRING    #language en-US        "Usb Port11"
                                        #language fr-FR        "Usb Port11"
                                        #language zh-TW        "Usb\wide埠\narrow11"
                                        #language it-IT        "Usb Porta 11"
                                        #language es-ES        "Usb Porta 11"
#string STR_USB_PORT11_ENABLE_HELP      #language en-US        "Enable/Disable Port 11"
                                        #language en-US        "Enable/Disable Port 11"
                                        #language zh-TW        "\wide啟用或取消埠\narrow11"
                                        #language it-IT        "Abilitare/Disabilitare Porta 11"
                                        #language es-ES        "Permita/Inhabilite Porta 11"
#string STR_USB_PORT12_ENABLE_STRING    #language en-US        "Usb Port12"
                                        #language fr-FR        "Usb Port12"
                                        #language zh-TW        "Usb\wide埠\narrow12"
                                        #language it-IT        "Usb Porta 12"
                                        #language es-ES        "Usb Porta 12"
#string STR_USB_PORT12_ENABLE_HELP      #language en-US        "Enable/Disable Port 12"
                                        #language en-US        "Enable/Disable Port 12"
                                        #language zh-TW        "\wide啟用或取消埠\narrow12"
                                        #language it-IT        "Abilitare/Disabilitare Porta 12"
                                        #language es-ES        "Permita/Inhabilite Porta 12"
#string STR_USB_PORT13_ENABLE_STRING    #language en-US        "Usb Port13"
                                        #language fr-FR        "Usb Port13"
                                        #language zh-TW        "Usb\wide埠\narrow13"
                                        #language it-IT        "Usb Porta 13"
                                        #language es-ES        "Usb Porta 13"
#string STR_USB_PORT13_ENABLE_HELP      #language en-US        "Enable/Disable Port 13"
                                        #language en-US        "Enable/Disable Port 13"
                                        #language zh-TW        "\wide啟用或取消埠\narrow13"
                                        #language it-IT        "Abilitare/Disabilitare Porta 13"
                                        #language es-ES        "Permita/Inhabilite Porta 13"
#string STR_USB_RMH_MODE_STRING         #language en-US        "USB RMH Mode"
                                        #language fr-FR        "USB RMH Mode"
                                        #language zh-TW        "USB RMH Mode"
                                        #language it-IT        "USB RMH Mode"
                                        #language es-ES        "USB RMH Mode"
#string STR_USB_RMH_MODE_HELP           #language en-US        "PCH USB Rate Matching Hubs mode"
                                        #language en-US        "PCH USB Rate Matching Hubs mode"
                                        #language zh-TW        "PCH USB Rate Matching Hubs mode"
                                        #language it-IT        "PCH USB Rate Matching Hubs mode"
                                        #language es-ES        "PCH USB Rate Matching Hubs mode"
#string STR_USB_DRIVER_SELECT_STRING    #language en-US        "USB Driver Select"
                                        #language fr-FR        "Selectionner USB Lecteur"
                                        #language zh-TW        "\wide選擇\narrowUSB\wide驅動方式\narrow"
                                        #language ja-JP        "\wideレガシー\narrowUSB\wideサポート\narrow:"
                                        #language it-IT        "Selezionare Driver USB"
                                        #language es-ES        "Selección de Conductor de USB"
                                        #language de-DE        "Wählen Sie USB Treiber aus"
                                        #language pt-PT        "USB Driver Selecionar"
#string STR_USB_DRIVER_SELECT_HELP      #language en-US        "EFI USB: Access USB devices in Shell. Legacy USB: USB devices boot and access in DOS"
                                        #language fr-FR        "EFI USB: Accéder aux USB devices dans Shell. Legacy USB: USB devices démarre et accèder à DOS"
                                        #language zh-TW        "EFI USB\wide在命令界面存取\narrowusb\wide裝置 傳統\narrowUSB\wide在\narrowDOS\wide下存取\narrowusb\wide裝置\narrow"
                                        #language ja-JP        "[\wide使用しない\narrow]            \wideこの機能を使用しません。\narrow                        [\wide使用する\narrow]              USB \wideに対応していない\narrowOS\wideで\narrowUSB \wideデバイスを使用できるようにします。\narrow"
                                        #language it-IT        "EFI USB: Accesso unita` USB in Shell. Legacy USB: attivazione unita` USB ed accesso in DOS"
                                        #language es-ES        "EFI USB: Tenga acceso a los Dispositivos del USB en Shell. USB de Herencia: Boot y acceso de dispositivos de USB en DOS"
                                        #language de-DE        "EFI USB: Greifen Sie auf USB Einheiten im Shell zu. Legacy USB: USB Geräte laden auf und greifen in DOS zu"
                                        #language pt-PT        "EFI USB: Aparelhos de Acesso USB em Shell. Legado USB: USB aparelhos boot e acesso em DOS"
#string STR_LEGACY_USB_DRIVER_STRING    #language en-US        "Legacy USB"
                                        #language fr-FR        "Legacy USB"
                                        #language zh-TW        "\wide傳統\narrowUSB"
                                        #language it-IT        "Legacy USB"
                                        #language es-ES        "USB de Herencia"
                                        #language de-DE        "Legacy USB"
                                        #language pt-PT        "Legacy USB"
#string STR_EFI_USB_DRIVER_STRING       #language en-US        "EFI USB"
                                        #language fr-FR        "EFI USB"
                                        #language it-IT        "EFI USB"
                                        #language es-ES        "EFI USB"
                                        #language de-DE        "EFI USB"
                                        #language pt-PT        "EFI USB"
#string STR_USB_LEGACY_STRING           #language en-US        "USB Legacy"
                                        #language fr-FR        "USB Legacy"
                                        #language ja-JP        "\wideレガシー\narrowUSB\wideサポート\narrow:"
#string STR_USB_LEGACY_HELP             #language en-US        "USB devices boot and access in DOS"
                                        #language fr-FR        "USB devices boot and access in DOS"
                                        #language ja-JP        "[\wide使用しない\narrow]            \wideこの機能を使用しません。\narrow                        [\wide使用する\narrow]              USB \wideに対応していない\narrowOS\wideで\narrowUSB \wideデバイスを使用できるようにします。\narrow"
#string STR_USB_PRE_FETCH_TIME_HELP               #language en-US        "Select USB Pre-fetch time"
                                                  #language fr-FR        "Select USB Pre-fetch time"
                                                  #language zh-TW        "Select USB Pre-fetch time"
                                                  #language it-IT        "Select USB Pre-fetch time"
                                                  #language es-ES        "Select USB Pre-fetch time"
#string STR_USB_SPH_TEXT                          #language en-US        "USB SPH"
                                                  #language fr-FR        "USB SPH"
                                                  #language zh-TW        "USB SPH"
                                                  #language it-IT        "USB SPH"
                                                  #language es-ES        "USB SPH"
#string STR_USB_OTG_TEXT                          #language en-US        "USB OTG"
                                                  #language fr-FR        "USB OTG"
                                                  #language zh-TW        "USB OTG"
                                                  #language it-IT        "USB OTG"
                                                  #language es-ES        "USB OTG"
#string STR_USB_SPH0_SPPOURT                      #language en-US        "USB SPH Support"
                                                  #language fr-FR        "USB SPH Support"
                                                  #language zh-TW        "USB SPH Support"
                                                  #language it-IT        "USB SPH Support"
                                                  #language es-ES        "USB SPH Support"
#string STR_USB_WAKE_ON_CONNECT_STRING            #language en-US        "Wake on connect"
                                                  #language fr-FR        "Wake on connect"
                                                  #language zh-TW        "Wake on connect"
                                                  #language it-IT        "Wake on connect"
                                                  #language es-ES        "Wake on connect"
#string STR_USB_WAKE_ON_DISCONNECT_STRING         #language en-US        "Wake on disconnect"
                                                  #language fr-FR        "Wake on disconnect"
                                                  #language zh-TW        "Wake on disconnect"
                                                  #language it-IT        "Wake on disconnect"
                                                  #language es-ES        "Wake on disconnect"
#string STR_USB_FORCE_FULL_SPEED_STRING           #language en-US        "Force Full Speed"
                                                  #language fr-FR        "Force Full Speed"
                                                  #language zh-TW        "Force Full Speed"
                                                  #language it-IT        "Force Full Speed"
                                                  #language es-ES        "Force Full Speed"
#string STR_PCH_USB_VBUS_PROMPT                   #language en-US "USB VBUS"
#string STR_PCH_USB_VBUS_HELP                     #language en-US "VBUS should be ON in HOST mode. It should be OFF in OTG device mode."
#string STR_USB_SUPPORT_STRING          #language en-US        "USB BIOS Support"
                                        #language fr-FR        "USB BIOS Support"
                                        #language ja-JP        "USB BIOS Support"
#string STR_USB_SUPPORT_UEFI_HELP       #language en-US        "USB keyboard/mouse/storage support under UEFI environment"
                                        #language fr-FR        "USB keyboard/mouse/storage support under UEFI environment"
                                        #language ja-JP        "USB keyboard/mouse/storage support under UEFI environment"
#string STR_USB_SUPPORT_LEGACY_HELP     #language en-US        "USB keyboard/mouse/storage support under UEFI and DOS environment. It will supporting UEFI environment only if set to UEFI Only"
                                        #language fr-FR        "USB keyboard/mouse/storage support under UEFI and DOS environment. It will supporting UEFI environment only if set to UEFI Only"
                                        #language ja-JP        "USB keyboard/mouse/storage support under UEFI and DOS environment. It will supporting UEFI environment only if set to UEFI Only"
#string STR_UEFI_ONLY_TEXT              #language en-US        "UEFI Only"
                                        #language fr-FR        "UEFI Only"
                                        #language ja-JP        "UEFI Only"
#string STR_PCH_SSIC_SUPPORT_PROMPT                    #language en-US "  SSIC Support Enable"
#string STR_PCH_SSIC_SUPPORT_HELP                      #language en-US "Enable / Disable SSIC Support"
#string STR_PCH_SSIC_INIT_SEQUENCE_PROMPT              #language en-US "  SSIC Init Sequence"
#string STR_PCH_SSIC_INIT_SEQUENCE_HELP                #language en-US "SSIC Initialization Sequence select.\n1:Windows, 2:Android"
#string STR_SEQUENCE_1                                 #language en-US "Sequence 1"
#string STR_SEQUENCE_2                                 #language en-US "Sequence 2"
#string STR_SSIC_HS_RATE_SERIES_PROMPT                 #language en-US "  SSIC HS Rate Series"
#string STR_SSIC_HS_RATE_SERIES_HELP                   #language en-US "Select SSIC HS Rate Series"
#string STR_SERIES_A                                   #language en-US "Series A"
#string STR_SERIES_B                                   #language en-US "Series B"
#string STR_PCH_USB_SSIC_PORT1_PROMPT                  #language en-US "  SSIC Port 1"
#string STR_PCH_USB_SSIC_PORT1_HELP                    #language en-US "Enable/Disable SSIC Port 1."
#string STR_PCH_USB_SSIC_PORT2_PROMPT                  #language en-US "  SSIC Port 2"
#string STR_PCH_USB_SSIC_PORT2_HELP                    #language en-US "Enable/Disable SSIC Port 2."
#string STR_PCH_USB_HSIC_PORT1_PROMPT                  #language en-US "  HSIC Port 1"
#string STR_PCH_USB_HSIC_PORT1_HELP                    #language en-US "Enable/Disable HSIC Port 1."
#string STR_PCH_USB_HSIC_PORT2_PROMPT                  #language en-US "  HSIC Port 2"
#string STR_PCH_USB_HSIC_PORT2_HELP                    #language en-US "Enable/Disable HSIC Port 2."                                        
#string STR_PCH_USB2_PHY_PG_PROMPT                     #language en-US "  USB2 PHY Power Gating"
#string STR_PCH_USB2_PHY_PG_HELP                       #language en-US "Configure USB2 PHY Power Gating"
